<a href="https://colab.research.google.com/github/anastalha07/Summer-Olympics-data-analysis-project/blob/main/Copy_of_Summer_Olympics_Analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns
%matplotlib inline
import pylab as plt
sns.set_style('darkgrid')
sns.set(rc={'figure.figsize':(16,12)})

In [ ]:
df = pd.read_csv("/content/drive/MyDrive/summer.csv")

In [ ]:
df.head()

   Year    City     Sport  ... Gender                       Event   Medal
0  1896  Athens  Aquatics  ...    Men              100M Freestyle    Gold
1  1896  Athens  Aquatics  ...    Men              100M Freestyle  Silver
2  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors  Bronze
3  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors    Gold
4  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors  Silver

[5 rows x 9 columns]

In [ ]:
df.shape

(31165, 9)

In [ ]:
df.isnull().sum()

Year          0
City          0
Sport         0
Discipline    0
Athlete       0
Country       4
Gender        0
Event         0
Medal         0
dtype: int64

In [ ]:
df.head()

   Year    City     Sport  ... Gender                       Event   Medal
0  1896  Athens  Aquatics  ...    Men              100M Freestyle    Gold
1  1896  Athens  Aquatics  ...    Men              100M Freestyle  Silver
2  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors  Bronze
3  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors    Gold
4  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors  Silver

[5 rows x 9 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31165 entries, 0 to 31164
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        31165 non-null  int64
 1   City        31165 non-null  object
 2   Sport       31165 non-null  object
 3   Discipline  31165 non-null  object
 4   Athlete     31165 non-null  object
 5   Country     31161 non-null  object
 6   Gender      31165 non-null  object
 7   Event       31165 non-null  object
 8   Medal       31165 non-null  object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

In [ ]:
print("Number of Country -->",len(df.Country.unique()))

Number of Country --> 148

In [ ]:
 df.Country.value_counts().tail()

GRN    1
BER    1
SUD    1
GAB    1
AHO    1
Name: Country, dtype: int64

In [ ]:
df.head()

In [ ]:
df.Medal.value_counts()

Gold      10486
Bronze    10369
Silver    10310
Name: Medal, dtype: int64

In [ ]:
df.Medal=='Gold'

0         True
1        False
2        False
3         True
4        False
         ...
31160    False
31161     True
31162    False
31163    False
31164    False
Name: Medal, Length: 31165, dtype: bool

In [ ]:
goldMedals = df[(df.Medal=='Gold')]

In [ ]:
df.head()

   Year    City     Sport  ... Gender                       Event   Medal
0  1896  Athens  Aquatics  ...    Men              100M Freestyle    Gold
1  1896  Athens  Aquatics  ...    Men              100M Freestyle  Silver
2  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors  Bronze
3  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors    Gold
4  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors  Silver

[5 rows x 9 columns]

In [ ]:
df = pd.concat([df,pd.get_dummies(df.Medal)],axis=1)

In [ ]:
df['allmedals'] = df['allmedals'] = df['Bronze'] + df['Gold'] + df['Silver']

In [ ]:
df.head()

   Year    City     Sport Discipline  ... Bronze Gold Silver allmedals
0  1896  Athens  Aquatics   Swimming  ...      0    1      0         1
1  1896  Athens  Aquatics   Swimming  ...      0    0      1         1
2  1896  Athens  Aquatics   Swimming  ...      1    0      0         1
3  1896  Athens  Aquatics   Swimming  ...      0    1      0         1
4  1896  Athens  Aquatics   Swimming  ...      0    0      1         1

[5 rows x 13 columns]

In [ ]:
 print("Number of Sport -->",len(df.Sport.unique()))

Number of Sport --> 43

In [ ]:
 print("Number of City -->",len(df.City.unique()))

Number of City --> 22